[
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnTUNRek5qc1NnEAE",
    "author": "Davis Bae",
    "date": "4 months ago",
    "rating": 5,
    "content": "Pacemaker has changed my life. I've received years of coaching from the Pacemaker team since its inception in 2009. Now I'm a 6 figure income earning real estate agent. I highly recommend it to anyone who's got the audacity to change his or her life."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME9LYThnRRAB",
    "author": "JIHYUN LEE",
    "date": "3 months ago",
    "rating": 5,
    "content": "As a developer looking for job opportunities in Canada, I had many concerns about resume writing and interview preparation. Thankfully, Pacemaker Consulting provided me with invaluable guidance throughout the process.\n\nThey offered detailed insights on how to craft an effective resume and how to prepare for interviews strategically, making my job search much more structured and efficient. Their advice helped me clearly articulate my experience and strengths, which significantly boosted my confidence.\n\nThanks to Pacemaker, I felt well-prepared and ready for my interviews. I highly recommend their services to anyone facing similar challenges!"
  },
  {
    "id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeWVFSmplSFpaVDA1cVJVazRZelpFY0hkVGFFRRAB",
    "author": "Jaden Yoo",
    "date": "a month ago",
    "rating": 5,
    "content": "I’m really grateful for the support I received through Pacemaker. They took the time to truly listen to what I was struggling with and offered advice that was practical and meaningful to my situation. What stood out the most was how they didn’t pretend to have all the answers, but instead shared what they had learned from their own experience and how they would approach things if they were in my shoes. That perspective really helped me see things more clearly and gave me the motivation to move forward. I appreciate the honest, thoughtful guidance. It made a real difference for me."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkkyRUV3EAE",
    "author": "Mirim Kim",
    "date": "4 months ago",
    "rating": 5,
    "content": "I’m truly grateful for the valuable insights, experiences, and advice I received from the mentors at Pacemaker. Talking with experienced professionals gave me clarity on issues I had been struggling with for days, and their perspectives helped me understand the mindset and approach I should take for my career and life planning. Pacemaker has an incredible group of mentors from diverse fields, broadening my perspective and helping me see the bigger picture. Whenever I feel uncertain or lack confidence, this community gives me motivation, courage, and the belief that I can overcome challenges. I’d like to extend my gratitude to Ralph, the amazing mentors at Pacemaker, and the fellow mentees who shared their experiences and support."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUNReDh2NmxnRRAB",
    "author": "Sadie Kim",
    "date": "4 months ago",
    "rating": 5,
    "content": "I was really lucky to meet Ralph early last year. He helped me with my resume and gave me so much advice which truly made a huge difference for me. Back then I had no idea what I was doing and I kept doubting myself wondering if I was on the right track. But Ralph always encouraged me and shared so much practical advice that helped me regain my motivation.\n\nI took everything he taught me and built on it step by step and in the end I was able to get the job I wanted and have since gained so many valuable experiences. I honestly don’t think I could have done it without him and I’m so incredibly grateful. Even now, whenever I feel exhausted or discouraged I think back to the things he told me and it gives me strength.\n\nThank you so much!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURQalBxZ2dRRRAB",
    "author": "추시은",
    "date": "7 months ago",
    "rating": 5,
    "content": "I recently attended a talk by Ralph from Pacemaker, and it left a lasting impression on me. During the talk, he mentioned, \"Take time to go on a date with yourself and your questions,\" and it resonated deeply with me. When it comes to crafting a resume or networking, the key is figuring out how to express yourself. And to do that, you first need to truly understand who you are. Although it was a short session, his impactful messages left a deep impression on me.\n\nRalph goes beyond simply giving advice—he shares realistic and inspiring stories based on his rich experiences. I was especially moved by how he focused on what he could do in the moment from a young age, gaining diverse experiences, and eventually working toward bigger dreams.\n\nHis meticulous and sincere approach makes him an invaluable resource for anyone grappling with career challenges. I highly recommend Ralph's talks at Pacemaker! 😊"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTURROWVEem53RRAB",
    "author": "Hwanjin Choi",
    "date": "4 months ago",
    "rating": 5,
    "content": "Thanks a bunch, Ralph! Your career coaching and your team’s expertise have been incredible. I’m completely satisfied with Pacemaker’s services and I’d highly recommend them to anyone looking to improve their career. You guys are the best!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURfbGF5MUNnEAE",
    "author": "Seongho Choi",
    "date": "5 months ago",
    "rating": 5,
    "content": "I asked Ralph to review my resume, and he kindly provided a thorough review. The related videos he posted on YouTube were especially helpful. I’ve been really impressed by how much he helps so many people with their job search. I am also working hard to get a job so that I can be someone who helps many people, just like Ralph."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUNRek1mY3F3RRAB",
    "author": "Sujin Ku",
    "date": "4 months ago",
    "rating": 5,
    "content": "This organization truly believes that every individual has potential and strength, and they “maximize every potential opportunity” to connect job candidates with employers based on their needs.\nEspecially, the Managing Director here is one of the people who lead a “psychologically rich life.” His team listens to individuals actively and attentively with genuine care to support them in exploring and reaching their career goals."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURuM1lmZmlRRRAB",
    "author": "Sun Kyou Kim",
    "date": "9 months ago",
    "rating": 5,
    "content": "I had a fantastic experience with Ralph today. The session was insightful and I walked away feeling much more confident about myself and my career direction. Not only did he provide valuable career guidance, but he also offered some thoughtful personal advice regarding my life choices, which really resonated with me. He really took the time to understand my professional aspirations and personal circumstances and I highly recommend Ralph to anyone seeking meaningful career and life guidance! :)"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURILWI2eDNRRRAB",
    "author": "Subin Park",
    "date": "10 months ago",
    "rating": 5,
    "content": "I had a great experience with Ralph from Pacemaker. He helped me with the resume, nailed down interview prep, and made the whole job search process easier. His advice and support were incredibly helpful and made a big difference. Highly recommend Pacemaker for anyone looking to boost their career!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHJucy13RRAB",
    "author": "Dayeong Kang",
    "date": "7 months ago",
    "rating": 5,
    "content": "I had the pleasure of attending the career coaching session during the recent KOTRA event last Thursday. I want to extend my sincere gratitude for the time and dedication Ralph and Linda devoted to the session. The insights and support Ralph and Linda provided were truly invaluable, and I left the session feeling inspired and better equipped for the next steps in my career journey.\n\nThe conversation with Linda was very enlightening. Her deep knowledge and the practical guidance she shared offered me a fresh perspective on navigating career challenges and opportunities. I am incredibly grateful for the commitment you both have shown to supporting the Korean community and fostering growth for professionals like myself. This initiative is a tremendous resource, and I greatly appreciate the hard work involved in making it possible.\n\nThank you once again for such a meaningful experience!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURubmE2alFREAE",
    "author": "hasan 1101",
    "date": "9 months ago",
    "rating": 5,
    "content": "If you are looking for real-life advice to grow your career, or having a hard time job seeking like me, this is the ONE. I feel blessed to meet Ralph at Pacemaker. I’ve never met someone who is very passionate and encouraging, even though I doubt myself sometimes. Trust me your resume look so much professional after meeting him 🤣 …"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNwczlhRmhBRRAB",
    "author": "Sun Do Cho",
    "date": "Edited a year ago",
    "rating": 5,
    "content": "Ralph is a brilliant consultant. He is very empathetic towards job seekers and understands the struggles they go through. That is why he takes a very personalized approach in helping you find the right career fit. Hats off to the team at Pacemaker!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURQOUlYUmVnEAE",
    "author": "김현종",
    "date": "7 months ago",
    "rating": 5,
    "content": "I was truly inspired by attending the seminar and listening to your lecture. I wanted to thank you for sharing such meaningful words!\n\nPersonally, I think it would be great if events like this were held several times a year to support working holiday participants in their 20s and 30s. These gatherings can give us strength and help us spread positive influence, not only in Korea but also in the wider world.\n\nThe seminar was more than just local leaders giving speeches. It was an opportunity to gain strength by seeing people who have faced and overcome many hardships and challenges, becoming the role models they are today. I could also feel the pure passion of the leaders wanting to support us, which gave me a lot of encouragement.\n\nI believe many other working holiday participants also felt supported by this event, especially since most of us came here alone or experienced being far from family for the first time. Thank you for creating such a meaningful moment!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME1LQnZnRRAB",
    "author": "조예원",
    "date": "3 months ago",
    "rating": 5,
    "content": "I had such a great time in sessions here! It was really helpful in training myself for job seeking. Strongly recommended"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNqdVlpaDNBRRAB",
    "author": "Kevin Khuu",
    "date": "a year ago",
    "rating": 5,
    "content": "Little late to the party, but Pacemaker has really helped me out throughout my journey as well. I would not be where I am without everyone here, and am happy to be apart of it. Going from being counselled regarding employment, to becoming the employment counselor is quite the journey!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNPMnN1UGlRRRAB",
    "author": "Anna",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is a really good career consultant. He tells me what I need to know when I write resume and how to incorporate general experience into resume. Furthermore, he helps me have positive energy and mind during the meeting. I think he is a professional career consultant, but he also helps  job seekers to have a healthy mind. I highly recommend  Ralph to who is seeking a job!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUR1bjhpcTV3RRAB",
    "author": "D. Lee",
    "date": "Edited 2 years ago",
    "rating": 5,
    "content": "Updated review:\n\nI have had the privilege of working with Kevin for my interview preparation. He was incredibly supportive, attentive, patient and encouraging from the start and really pushed me to believe in myself. He provided me with helpful tips and excellent strategies to succeed in the interview and boosted my confidence. I am extremely grateful for his help. He is an excellent mentor for anyone who wants to develop their interview skills to land their dream job. I would highly recommend him to anyone who needs help with mock interview and resume.\n\n-------------------------------------------------------------------------------------------------------Original review:\n\nI'd like to start this review/feedback by thanking Ralph, William, and Linda for giving me this opportunity to be part of the webinar today. I was truly lucky to be able to learn something valuable. From how to write an appealing resume (and that you shouldn't be using the same generic resume over and over...which I shouldn't be doing anymore haha) to how to approach a job interview, best practices for behavioral questions, and why you should be confident and ready to sell yourself, there were so many important tips that I made three full pages of note. Because I have an unexpected interview scheduled which aligns with my pre-planned travel, I was naturally stressed and anxious about it; but thanks to their help and thoughtful advice, I'm confident that I'll and I should do my best to prepare for the interview and ace it. Reach out to them if you need any help getting a job. It's never too late!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtNWVtZ3pRRRAB",
    "author": "Nathan Cho",
    "date": "3 years ago",
    "rating": 5,
    "content": "Especially during COVID, it is quite a challenge to prepare a career plan. Starting from writing a cover letter to actual interview preparation, Ralph is a great pacer who will be with you along the whole process and always ready to answer by proving quality and up to date job market trends and information. As a current HR Consultant myself, Pacemaker is a great career coaching service."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUNqNTdxS0FREAE",
    "author": "Matt M",
    "date": "a year ago",
    "rating": 5,
    "content": "I was in luck to get help from Ralph. Fortunately he was able to identify what I was lacking and easily dissected into areas that needs improvement. Im very grateful for this opportunity! I cant wait to continue learning across few days."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURlMDlyMVdREAE",
    "author": "sunghyun Yoon",
    "date": "2 years ago",
    "rating": 5,
    "content": "I had difficulties preparing for a job, but Ralph kindly helped me.  He is very grateful for the advice he from experiences.  He gave me one-point coaching on how to write a resumé and a cover letter. I can't thank you enough. Appreciate it! :)"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURteFpULTl3RRAB",
    "author": "Taewoong Nam",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is the best career consultant👍🏽\nHe led students from making resume to getting job with his professional knowledge and experience.\nHighly recommend to who is seeking a job or changing career!!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUNXaEx6VFdREAE",
    "author": "Hailee Yu",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is the best career coach! He actually listens to you and offers appropriate solutions with a variety of alternatives. He will define where you got lost and where you need help. If you're not looking for a career change, but just want some sound advice on how to improve your stress management, conflict resolution, and self-confidence in your current position, he can definitely help."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUNXaE8tSkV3EAE",
    "author": "Kate LEE",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is an outstanding consultant to find out your ideal career path and help you set a clear vision of your goal. He is passionate, caring and professional to give advice and updates that suit your situation. I could not recommend Ralph more highly!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNXc3ZtUDBBRRAB",
    "author": "Sean Phu",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph has been most helpful during my career change. He preped my resume and interview. I was ultimately hired for my desired position. Highly recommended!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUQyMnB2bWZREAE",
    "author": "Vara Kim (Vara_Kim)",
    "date": "3 years ago",
    "rating": 5,
    "content": "I think that the most difficult part of preparing career plan is strong mental. Above all, Ralph helps the job seeker to have positive energy and confidence. and believe that can lead to remarkable results!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtaGEtRjJ3RRAB",
    "author": "Ethan Sung Hoo Park",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is wonderful. He encourages his students with a great leadership and care. I highly recommend him if you are seeking for new career or just advice in general!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNXaEtPcjdRRRAB",
    "author": "Rebekah Joo",
    "date": "3 years ago",
    "rating": 5,
    "content": "Big KOODOS to Ralph! He was able to guide me with my career development  from the beginning to the end. Ralph is very professional and helpful and he provides all the support that you would need to succeed. Highly Recommended!!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUQyeDZTZE5nEAE",
    "author": "Hyesu Hong",
    "date": "3 years ago",
    "rating": 5,
    "content": "There are lots of people struggling with starting off their new career path. For that, Pacemaker is the one who can support, lead you, and pull off your hidden strength and confidence. I am 100% sure that a fantastic experience with Pacemaker would be your asset in your future."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dWJmQ0J3EAE",
    "author": "Yunji Ham",
    "date": "a year ago",
    "rating": 5,
    "content": "Their guidance was helpful for my interview preparation, allowing me to approach the process with confidence and well-prepared responses."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURXX1pDMXNnRRAB",
    "author": "Judy",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph is a very professional consultant! The career coaching services are really helpful to achieve career goals :)"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUN3cU8yTXV3RRAB",
    "author": "Sasha Kim",
    "date": "4 months ago",
    "rating": 5,
    "content": "I got resume review and it was really helpful. So appreciated for the detailed review😁 …"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUM1X3FmQ0tnEAE",
    "author": "SEWOONG LEE",
    "date": "a year ago",
    "rating": 5,
    "content": "They provided very helpful guidance and support for the entire process. They were attentive to my situation, took the time to understand my career goals!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNXLS11bTZRRRAB",
    "author": "Sojin Park",
    "date": "3 years ago",
    "rating": 5,
    "content": "It was great time to spent with Ralph. He always inspire me and help me to grow up. You can't buy it with money. Highly recommend those who want to growing all together."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURIMXIyTmxnRRAB",
    "author": "Jt Chung",
    "date": "10 months ago",
    "rating": 5,
    "content": "Trust, integrity, passionate,caring these are all about the Pacemaker that I experienced with Peacemaker Team."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUMtcmRudkFnEAE",
    "author": "Seungmin Kim",
    "date": "2 years ago",
    "rating": 5,
    "content": "People working here are so helpful and I can see that they are willing to help others for no reason which is cool at all. I at fist had a doubt about why they were helping me without wanting anything. However, I recognized that they just liked to help people and believed that their supports would come back to them as time went by.\n\nThanks for your support always"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURXaE1lY09REAE",
    "author": "Naeun Song",
    "date": "3 years ago",
    "rating": 5,
    "content": "He is the best person who can advise and teach people to get their career goal. He is also good listener. When I was working with him, he listens all my stories and make a connection to my career path so that I can make my own story."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURIbE1XV3VRRRAB",
    "author": "kim hyounte",
    "date": "Edited 10 months ago",
    "rating": 5,
    "content": "Ralph is a really helpful consultant."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUQxcDhTeVZ3EAE",
    "author": "Kuk Jae Oh",
    "date": "a year ago",
    "rating": 5,
    "content": "Excellent service and very friendly staff.\nAbsolutely recommend for job consulting who need."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtaGEtVHVnRRAB",
    "author": "Wi Dae Hwan",
    "date": "3 years ago",
    "rating": 5,
    "content": "I'm sure Pacdmaker will be great community for everyone and growing all together."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtbTQzSWd3RRAB",
    "author": "S Ahn",
    "date": "3 years ago",
    "rating": 5,
    "content": "Thank you so much for amazing service! I couldn't change my career without your great support!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtaFp1Y3B3RRAB",
    "author": "Min Rugi",
    "date": "3 years ago",
    "rating": 5,
    "content": "👍👍👍 …"
  },
  {
    "id": "Ci9DQUlRQUNvZENodHljRjlvT2xScE0wVkVVbVpPWDNKR1dWaDFZblY0YjFkNldVRRAB",
    "author": "Alicia Hyomin Kim",
    "date": "3 days ago",
    "rating": 5,
    "content": "The counselor was warm and approachable. Speaking with him was a great opportunity; his guidance was both helpful and indispensable."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURmX3Z5QnRnRRAB",
    "author": "Sylvia An",
    "date": "6 months ago",
    "rating": 5,
    "content": "If you are new to preparing for a job in Canada, this is a great place to get advice! All of the PACE MAKER teachers, including Ralph, were great. It was a valuable time to gain a lot of insight while preparing for the special lectures and group studies held at PACE MAKER. It is a great place to find direction for your life beyond employment. If you are thinking about building a career in Canada, I highly recommend you get in touch!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0pfUHRBRRAB",
    "author": "이정희",
    "date": "9 months ago",
    "rating": 5,
    "content": "I had a wonderful session with Ralph today. We talked for about an hour over the phone, and throughout the session, he was very compassionate and understanding about my current situation and the problems I'm facing. He also provided brief yet detailed steps and advice regarding the choices I can make right now, my future career, and current opportunities.\n\nMoreover, based on what Ralph shared, he and his team at Pacemaker have a solid group of talented mentors and instructors working in various sectors of the industry and organizations. These professionals can help guide you to find and succeed in your own career path. Ralph also strongly emphasized that more people who are struggling with finding a job, planning their careers, or even facing difficulties in life should reach out to him or his team, so they can help as many people as possible.\n\nAfter watching Ralph's KCWA lecture through an acquaintance, we set up a meeting. Ralph contacted me and we had a consultation over the phone today for about an hour. We had an honest conversation about the difficulties and problems I was currently experiencing. Ralph also seems to have gone through a lot of trial and error to get to where he is today, so the words he said throughout the consultation touched my heart even more. Ralph and the mentors and guides at Pacemaker are people who work in a variety of fields, so I think they will be very helpful to those who are having difficulty finding a job. Lastly, Ralph said that he would like to help many people who are having difficulty finding a job or are in a bad situation so that they do not go through the same trial and error as he did, so if you think you are one of these people, I strongly recommend that you do not worry and contact Pacemaker for consultation."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURQM1BDLUZBEAE",
    "author": "노영진",
    "date": "7 months ago",
    "rating": 5,
    "content": "Recently, when I participated in a program organized by KCWA, I heard Ralph's lecture. Although it was only a short period of time, I was able to gain a lot of very useful information, such as the attitude you should have when looking for a job in Korea and abroad, what to include in your resume, and tips for self-objectification. I would like to contact you often in the future!\n\nRecently, when I participated in a program organized by KCWA, I heard Ralph's lecture. Although it was a short period of time, I was able to gain a lot of very useful information, such as the attitude you should have when looking for a job in Korea and abroad, what to include in your resume, and tips for self-objectification. I would like to contact you often in the future!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnTUR3MEpLd2VREAE",
    "author": "Lois Kim",
    "date": "3 months ago",
    "rating": 5,
    "content": "It was a very satisfying workshop.\nThank you Ralph and Linda for the 6 hours of lecture!\nI received so much support and teaching🤍 …"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURQc3RQXzFRRRAB",
    "author": "SJ K",
    "date": "7 months ago",
    "rating": 5,
    "content": "By chance, I heard a lecture by the CEO of Pacemaker. Although it was a short time, it made me think a lot, and it was a touching lecture that really conveyed the CEO's sincerity! If you are experiencing any difficulties, I recommend that you receive comfort and courage through the CEO's lecture!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNubXZXdWx3RRAB",
    "author": "김치랑꼬미랑",
    "date": "9 months ago",
    "rating": 5,
    "content": "I prepared for a job change on my own for over a year, but I didn't get good results. After being introduced to Teacher Ralph, I was heading in the wrong direction with the wrong resume and cover letter. From free consulting, I received consulting from an expert teacher."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURQOU96SmJnEAE",
    "author": "Lucy Ssong",
    "date": "7 months ago",
    "rating": 5,
    "content": "You provided detailed explanations and detailed information on important things that the 2030 generation who grew up in Korea their entire lives, who may be struggling to settle down in Canada, are missing. It was a precious time where I was able to learn skills about my 'career' that I had never learned while growing up in Korea, things I need to know to appeal to Canadian society, and things I need to think about at least once. I think people in their 20s and 30s who are spending their youth in Canada should definitely listen to CEO Lee Woo-seop's lecture at least once. I was able to gain the strength to endure the dark and frustrating days right now. I was grateful to hear the good energy and words. ^^"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUM5dW9lYUhnEAE",
    "author": "Moon",
    "date": "a year ago",
    "rating": 5,
    "content": "I didn't know where to start when preparing for my first job search, but I'm so happy that I got a consulting on how to write a resume and cover letter! In particular, they provide consulting that matches the latest trends and various tips that fit the position. And through consistent meetings and multiple revisions, you can write a resume and cover letter that will continue to improve! They also guide and support you in preparing for interviews and other preparations necessary for employment, which is reassuring. I really recommend it to those who are looking for a job in Canada for the first time :)"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNsaXBxdjZ3RRAB",
    "author": "Yenna K",
    "date": "a year ago",
    "rating": 5,
    "content": "While I was preparing for a job change, I had a lot of failures in the third and final interview, so my confidence in interviewing was very low. At that time, there was an interview interview seminar hosted by Ralph and Kevin's presentation, and I attended it. The tips I got from that time and the mock interview I had were really helpful in my success with this job change.\nI also received brief Resume consulting from the mentor (park) that Ralph connected me to. Based on the comment from the mentor that all the bullet points were too generic, I specified detailed numbers, percentages, etc. for each item. We have continuously developed Resume in this direction.\nI believe that all of this build-up has helped me succeed in changing jobs to where I am today :) Thank you so much for allowing me to receive valuable help, Mr. Ralph ㅠ.ㅠ"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME1yTnpRRRAB",
    "author": "김희승",
    "date": "3 months ago",
    "rating": 5,
    "content": "It was a useful time where I learned a lot and found out what I was lacking. It was also a time when I learned what my strengths were."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUMtbE5pQjd3RRAB",
    "author": "YSY Kim",
    "date": "2 years ago",
    "rating": 5,
    "content": "If you are at the beginning of your job search and are having trouble finding your way, Pacemaker is the answer. When I didn't know where to start, he gave me ideas that I could start with in a short period of time. He also really enjoys this work, so I can get sincere advice. Also, I was able to awaken the essence of job search preparation that I had forgotten through YouTube videos. Especially, the session with Ralph was very helpful to me who was preparing an English resume for the first time."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURXNXV6S1VREAE",
    "author": "JW H",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph listens kindly to my story and I am receiving help that I have never experienced before. It was nice to be able to have a good conversation today, and I hope to continue creating good experiences and memories with Ralph in the future."
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtaGYtRHFnRRAB",
    "author": "Jay PARK",
    "date": "3 years ago",
    "rating": 5,
    "content": "Opportunity to receive coaching from professional mentors and engage in various networking through a 1:1 customizing career coaching program, including resumes, cover letters, expected interview questions, script writing, and mock interviews!!!\nI personally received a lot of help when transitioning from ECE to a new field, and I always feel reassured.\nI highly recommend it to everyone who is new to the workforce, has just arrived in Canada, or is preparing to change jobs 👍🏻"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtazlXeTdnRRAB",
    "author": "sohyun kim",
    "date": "3 years ago",
    "rating": 5,
    "content": "Ralph and the coaches were all so kind and knowledgeable, so they answered everything I asked! Mental management is the hardest thing to do when preparing for a job, but thanks to this, I was motivated a lot and the thought of preparing together gave me a lot of willpower :)"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUNXNGY3Z0dREAE",
    "author": "Yang Won Ju",
    "date": "3 years ago",
    "rating": 5,
    "content": "They take good care of everything you need to get a job, including resumes, cover letters, and interviews. And it didn't end there, it was nice to be able to get to know a variety of people because Insaralph paid attention to networking as well."
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSUQydU1IT0ZREAE",
    "author": "Jeongmi Lee",
    "date": "3 years ago",
    "rating": 5,
    "content": "Thank you for your 5 star!\nWe really appreciate your feedback.  Please let us know if there's anything we can help you more!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSUNXLW9tUjZBRRAB",
    "author": "Yu Na Koo",
    "date": "3 years ago",
    "rating": 5,
    "content": "So happy to hear from you, Yuna.\nWe really appreciate your feedback.\nI look forward to seeing you next week.  cheers!"
  },
  {
    "id": "ChdDSUhNMG9nS0VJQ0FnSURtNjRxRWxBRRAB",
    "author": "정신영",
    "date": "3 years ago",
    "rating": 5,
    "content": "Thanks a lot, Shinyoung :)\nAlways appreciate your support and we will be always rooting for you!"
  },
  {
    "id": "ChZDSUhNMG9nS0VJQ0FnSURteFpDLVJBEAE",
    "author": "paddington",
    "date": "3 years ago",
    "rating": 5,
    "content": "Thank you so much and always appreciate your support :)"
  }
]
